// AtCoder_Cpp.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//
// EX4 - ◯年は何秒？ / 1.04
// https://atcoder.jp/contests/apg4b/tasks/APG4b_cs

#include <iostream>
// #include <bits/stdc++.h>
using namespace std;

int main() {
	// 一年の秒数
	int seconds = 365 * 24 * 60 * 60;

	// 以下のコメント/* */を消して追記する
	cout << seconds << endl; /* 1年は何秒か */
	cout << seconds * 2 << endl; /* 2年は何秒か */
	cout << seconds * 5 << endl; /* 5年は何秒か */
	cout << seconds * 10 << endl; /* 10年は何秒か */
}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
